<a href="https://colab.research.google.com/github/mugdhav/IBMCert/blob/master/PandasExercise.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

These are Pandas code snippets from IBM Certification course.

Following snippet imports both the pandas library for data handling and io library for file handling

In [0]:
import pandas as pnd
import io

In [12]:
from google.colab import files
uploaded = files.upload()

Saving example.csv to example (1).csv

In [26]:
dframe_csv = pnd.read_csv(io.BytesIO(uploaded['example.csv']))
dframe_csv.head()
#dframe_excel.describe()

     Name Last Name  G
0  mickey     mouse  m
1  donald      duck  m
2  minnie     mouse  f

Create a dataframe from a dictionary

In [50]:
city_temp_celcius = {"Cities":['Delhi', 'Mumbai', 'Chennai', 'kolkata'], 'Temperature': [35, 45, 40, 39], 'Min':[20,28,25,31], 'Max':[41,49,45,42]}
dFrame_cityTemp = pnd.DataFrame(city_temp_celcius)
dFrame_cityTemp.head()
#dFrame_cityTemp.describe()

    Cities  Temperature  Min  Max
0    Delhi           35   20   41
1   Mumbai           45   28   49
2  Chennai           40   25   45
3  kolkata           39   31   42

In [51]:
new_dFrame = dFrame_cityTemp[['Cities','Temperature']]
new_dFrame.head()

    Cities  Temperature
0    Delhi           35
1   Mumbai           45
2  Chennai           40
3  kolkata           39

In [59]:
print(dFrame_cityTemp.iloc[0,0])
print(dFrame_cityTemp.loc[2, 'Temperature'])

Delhi
40

In [60]:
dFrame_sliced = dFrame_cityTemp.loc[0:1, "Cities":"Temperature"] #Notice the range upper limit behavior here. Two rows: 0 & 1
dFrame_sliced.head()

   Cities  Temperature
0   Delhi           35
1  Mumbai           45

In [62]:
dFrame_sliced = dFrame_cityTemp.iloc[0:1,0:2] #notice the range upper limit behaviour here. The result is onlly one row: index 0
dFrame_sliced.head()

  Cities  Temperature
0  Delhi           35

DataFrame operations: unique and specific values

In [64]:
print(dframe_csv['G'].unique())

['m' 'f']

Slicing with condition

In [65]:
dFrame_conditional = dFrame_cityTemp[dFrame_cityTemp['Temperature']>=40]
dFrame_conditional.head()

    Cities  Temperature  Min  Max
1   Mumbai           45   28   49
2  Chennai           40   25   45

Save as CSV

In [0]:
dFrame_cityTemp.to_csv('CityTemperature.csv')

In [69]:
dframe_csv2 = pnd.read_csv('CityTemperature.csv')
dframe_csv2.describe()

       Unnamed: 0  Temperature        Min        Max
count    4.000000     4.000000   4.000000   4.000000
mean     1.500000    39.750000  26.000000  44.250000
std      1.290994     4.112988   4.690416   3.593976
min      0.000000    35.000000  20.000000  41.000000
25%      0.750000    38.000000  23.750000  41.750000
50%      1.500000    39.500000  26.500000  43.500000
75%      2.250000    41.250000  28.750000  46.000000
max      3.000000    45.000000  31.000000  49.000000